# IdeaStatiCa.RcsApi.Model.TendonBar

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Id** | **int** |  | [optional]
**TendonType** | **TendonBarType** |  | [optional]
**Point** | **Point2D** |  | [optional]
**Material** | **ReferenceElement** |  | [optional]
**PrestressingOrder** | **int** |  | [optional]
**NumStrandsInTendon** | **int** |  | [optional]
**PrestressReinforcementType** | **FatigueTypeOfPrestressingSteel** |  | [optional]
**Phase** | **int** |  | [optional]
**TendonDuct** | **TendonDuct** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)